import telebot
from telebot import types

bot = telebot.TeleBot("8482207819:AAFDltd2_ubkSzlqLR6evEuh089oI2w9rGM")

@bot.message_handler(commands=['start'])
def start(message):
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    btn1 = types.KeyboardButton("Каталог")
    btn2 = types.KeyboardButton("Оформить заказ")
    btn3 = types.KeyboardButton("Связаться с менеджером")
    btn4 = types.KeyboardButton("Ознакомление")
    btn5 = types.KeyboardButton("Условия")
    btn6 = types.KeyboardButton("Отследить доставку(скоро)")
    markup.add(btn1, btn2, btn3, btn4 , btn5 , btn6)

    bot.send_message(
        message.chat.id,
        "Привет, Я ваш менеджер по заказу товаров. Наш TG канал: https://t.me/+xflnjkNDMD5jNDNi",
        reply_markup=markup
    )
    
@bot.message_handler(content_types=['text'])
def handle_text(message):
    if message.text == "Каталог":
        bot.send_message(message.chat.id, "Вы можете найти любой понравившися товар из следующих сайтов , или перейти на наш сайт (скоро будет достпуно)")
        with open("Товары USA Original/deliverybot/catalog.html", "rb") as file:
            bot.send_document(message.chat.id, file)
    elif message.text == "Оформить заказ": 
        textInfo="Данная усулга ещё в разработке!"
        bot.send_message(message.chat.id , textInfo)
    elif message.text == "Связаться с менеджером": 
        textInfo="Для связи с менеджером оставьте следующие данные:"
        bot.send_message(message.chat.id , textInfo)
    elif message.text == "Ознакомление": 
        textInfo = """Здравствуйте! Меня зовут Нурбала. Я — ваш персональный байер, который делает покупки в США максимально удобными, безопасными и выгодными. Я работаю напрямую с магазинами и брендами, тщательно выбираю только качественные и проверенные товары, отслеживаю актуальные тренды и сравниваю цены. Каждая покупка находится под моим контролем – от поиска товара до его доставки к вам домой.

Вы получаете:
	•	Подбор товаров по вашим запросам.
	•	Честные цены без скрытых комиссий.
	•	Проверка качества перед отправкой.
	•	Фото- и видеоотчет для полной прозрачности.
	•	Аккуратная доставка и поддержка на каждом этапе заказа.

Я строю работу на доверии, внимательности и честности, поэтому большинство клиентов возвращаются снова и рекомендуют меня друзьям. Если вы ищете надёжного байера, который заботится о вашем заказе так же, как о своём, вы по адресу! Напишите мне, и я подберу для вас лучшее решение.

🚚 Доставка осуществляется по фактическому весу и стране отправления. Я всегда сообщаю итоговую цену заранее, чтобы не было никаких сюрпризов. Никаких скрытых платежей — только честные и прозрачные условия.

💬 Почему это выгодно? Вы оплачиваете только мои услуги и доставку — без накруток и дополнительных комиссий. Я забочусь о том, чтобы ваш заказ был качественным и оригинальным, и чтобы он дошёл до вас в целости и сохранности.
""" 
        bot.send_message(message.chat.id , textInfo)
    elif message.text == "Условия":
        textInfo="""🛍 Услуги байера – 10% от стоимости товара. В эту сумму включены:
	•	Поиск товара по вашим запросам.
	•	Проверка магазина и продавца.
	•	Оформление заказа.
	•	Оплата при оформлений заказа(перед отправкой).
	•	Фото и видеоотчет перед отправкой.
	•	Полное сопровождение до получения посылки."""
        bot.send_message(message.chat.id , textInfo)
    elif message.text == "Отследить доставку(скоро)":
        textInfo= """Данная услуга  ещё в разработке!"""
        bot.send_message(message.chat.id , textInfo)
bot.polling()